boss/config/ims/ADD_SBR.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<Authentication>
			<Username>#{user}</Username>
			<Password>#{password}</Password>
		</Authentication>
		<MessageID>#{seq}</MessageID>
	</soap:Header>
	<soap:Body>
		<ADD_SBR xmlns="http://www.huawei.com/SPG">
			<IMPU>sip:+8620#{businessKey}@ims.kongguanju.com</IMPU>
			<LP>0</LP>
         <CSC>0</CSC>
         <UTYPE>0</UTYPE>
         <VCCFLAG>0</VCCFLAG>
         <LCO>1</LCO>
         <LC>1</LC>
         <LCT>1</LCT>
         <NTT>1</NTT>
         <ITT>1</ITT>
         <ICTX>1</ICTX>
         <OCTX>1</OCTX>
         <INTT>1</INTT>
         <IITT>1</IITT>
         <ICLT>1</ICLT>
         <ICDDD>1</ICDDD>
         <ICIDD>1</ICIDD>
         <IOLT>1</IOLT>
         <CCO1>1</CCO1>
         <CCO2>1</CCO2>
         <CCO3>1</CCO3>
         <CCO4>1</CCO4>
         <CCO5>1</CCO5>
         <CCO6>1</CCO6>
         <CCO7>1</CCO7>
         <CCO8>1</CCO8>
         <CCO9>1</CCO9>
         <CCO10>1</CCO10>
         <CCO11>1</CCO11>
         <CCO12>1</CCO12>
         <CCO13>1</CCO13>
         <CCO14>1</CCO14>
         <CCO15>1</CCO15>
         <CCO16>1</CCO16>
         <IDDCI>1</IDDCI>
         <NTCI>1</NTCI>
         <LTCI>1</LTCI>
         <CIG>4294967295</CIG>
         <OUTRST>0</OUTRST>
         <INRST>0</INRST>
         <NOAT>20</NOAT>
         <VMAIND>65535</VMAIND>
         <VDMAIND>65535</VDMAIND>
         <TGRP>65535</TGRP>
         <TIDHLD>28</TIDHLD>
         <TIDCW>23</TIDCW>
         <SCF>0</SCF>
         <LMTGRP>9</LMTGRP>
         <FLBGRP>65535</FLBGRP>
         <SLBGRP>65535</SLBGRP>
         <COP>202009</COP>
         <G711_64K_A_LAW>1</G711_64K_A_LAW>
         <G711_64K_U_LAW>1</G711_64K_U_LAW>
         <G722>1</G722>
         <G723>1</G723>
         <G726>1</G726>
         <G728>1</G728>
         <G729>1</G729>
         <CODEC_MP4A>0</CODEC_MP4A>
         <HIGHENTCO>0</HIGHENTCO>
         <ACODEC>255</ACODEC>
         <VCODEC>255</VCODEC>
         <POLIDX>255</POLIDX>
         <NCPI>255</NCPI>
         <EBOCL>0</EBOCL>
         <EBOPL>0</EBOPL>
         <EBOIT>2</EBOIT>
         <RM>0</RM>
         <CPC>0</CPC>
         <TFPT>4</TFPT>
         <MCIDMODE>0</MCIDMODE>
         <MCIDCMODE>255</MCIDCMODE>
         <PREPAIDIDX>65535</PREPAIDIDX>
         <CRBTID>65535</CRBTID>
         <ODBBICTYPE>0</ODBBICTYPE>
         <ODBBOCTYPE>0</ODBBOCTYPE>
         <ODBBARTYPE>0</ODBBARTYPE>
         <ODBSS>0</ODBSS>
         <ODBBRCFTYPE>0</ODBBRCFTYPE>
         <PNOTI>0</PNOTI>
         <MAXPARACALL>1</MAXPARACALL>
         <ATSDTMBUSY>1</ATSDTMBUSY>
         <CALLCOUNT>1</CALLCOUNT>
         <CDNOTICALLER>0</CDNOTICALLER>
         <ISCHGFLAG>0</ISCHGFLAG>
         <CHC>0</CHC>
         <CUSER>0</CUSER>
         <STCF>0</STCF>
         <CHARSC>65535</CHARSC>
         <REGUIDX>0</REGUIDX>
      </ADD_SBR>
	</soap:Body>
</soap:Envelope> 
